Catalogs/ТСДФорматыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ТСДФорматыДанных</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СвязываемыеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПараметрНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТСДПоляДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеТСД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТСДПоляДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТСДПоляДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ШтрихКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураНаименование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураАртикул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураХарактеристика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураСерия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураИзмерение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураЦена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоНаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Качество</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТСДФорматыДанных/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
//// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мПолеШтрихкод;
Перем мПолеНаименованиеНоменклатуры;
Перем мПолеАртикулНоменклатуры;
Перем мПолеХарактеристикаНоменклатуры;
Перем мПолеСерияНоменклатуры;
Перем мПолеЕдиницаИзмерения;
Перем мПолеКодНоменклатуры;
Перем мПолеЦенаНоменклатуры;
Перем мПолеКоличествоНоменклатуры;
Перем мПолеКачество;


///////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ

// Функция осуществляет формирование соответствия, содержащего поля, которые
// учтены в данном формате данных.
//
// Параметры:
//  Штрихкод                       - <Строка>
//                                 - Штрихкод товара.
//
//  Номенклатура                   - <СправочникСсылка.Номенклатура>
//                                 - Номенклатура.
//
//  ЕдиницаИзмерения               - <СправочникСсылка.ЕдиницыИзмерения>
//                                 - Единица измерения номенклатуры.
//
//  ХарактеристикаНоменклатуры     - <СправочникСсылка.ХарактеристикиНоменклатуры>
//                                 - Характеристика номенклатуры.
//
//  СерияНоменклатуры              - <СправочникСсылка.СерииНоменклатуры>
//                                 - Серия номенклатуры.
//
//  Качество                       - <СправочникСсылка.Качество>
//                                 - Качество.
//
//  Цена                           - <Число>
//                                 - Цена номенклатуры.
//
//  Количество                     - <Число>
//                                 - Количество номенклатуры.
//
// Возвращаемое значение:
//  <Соответствие>                 - Соответствие полей.
//
Функция ПолучитьСоответствиеПолейТСД(Штрихкод, Номенклатура, ЕдиницаИзмерения,
                                     ХарактеристикаНоменклатуры, СерияНоменклатуры,
                                     Качество, Цена, Количество) Экспорт

	Результат       = Новый Соответствие();
	Поле            = Неопределено;
	Наименование    = СокрЛП(Номенклатура);
	Артикул         = СокрЛП(Номенклатура.Артикул);
	Характеристика  = СокрЛП(ХарактеристикаНоменклатуры);
	Серия           = СокрЛП(СерияНоменклатуры);
	ЕдИзм           = СокрЛП(ЕдиницаИзмерения);
	КодНоменклатуры = СокрЛП(Номенклатура.Код);
	ЦенаСтр         = Формат(Цена, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0");
	КолвоСтр        = Формат(Количество, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0");
	КачествоСтр     = СокрЛП(Качество);

	Для Каждого Поле Из СвязываемыеПоля Цикл
		ИмяПоля      = "Поле" + Формат(Поле.ПолеТСД, "ЧДЦ=0; ЧН=0; ЧГ=0");
		

		Если      Поле.ПараметрНоменклатуры = мПолеШтрихкод Тогда
			Результат[ИмяПоля] = Штрихкод;
		ИначеЕсли Поле.ПараметрНоменклатуры = мПолеНаименованиеНоменклатуры Тогда
			Результат[ИмяПоля] = Наименование;
		ИначеЕсли Поле.ПараметрНоменклатуры = мПолеАртикулНоменклатуры Тогда
			Результат[ИмяПоля] = Артикул;
		ИначеЕсли Поле.ПараметрНоменклатуры = мПолеХарактеристикаНоменклатуры Тогда
			Результат[ИмяПоля] = Характеристика;
		ИначеЕсли Поле.ПараметрНоменклатуры = мПолеСерияНоменклатуры Тогда
			Результат[ИмяПоля] = Серия;
		ИначеЕсли Поле.ПараметрНоменклатуры = мПолеЕдиницаИзмерения Тогда
			Результат[ИмяПоля] = ЕдИзм;
		ИначеЕсли Поле.ПараметрНоменклатуры = мПолеКодНоменклатуры Тогда
			Результат[ИмяПоля] = КодНоменклатуры;
		ИначеЕсли Поле.ПараметрНоменклатуры = мПолеЦенаНоменклатуры Тогда
			Результат[ИмяПоля] = ЦенаСтр;
		ИначеЕсли Поле.ПараметрНоменклатуры = мПолеКоличествоНоменклатуры Тогда
			Результат[ИмяПоля] = КолвоСтр;
		Иначе // Если Поле.ПараметрНоменклатуры = мПолеКачество
			Результат[ИмяПоля] = КачествоСтр;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции // ПолучитьСоответствиеПолейТСД()

// Процедура возвращает параметры номенклатуры из соответствия полей ТСД.
//
// Параметры:
//  СоответствиеПолей - <Соответствие>
//                    - Соответствие, содержащее значения полей таблицы ТСД.
//                      Значению поля X ТСД соответствует ключ "ПолеX".
//
//  Штрихкод          - <Строка>
//                    - Выходной параметр; штрихкод товара.
//
//  Количество        - <Число>
//                    - Выходной параметр; количество товара.
//
Процедура ПолучитьСодержимоеСоответствияПолейТСД(СоответствиеПолей, Штрихкод,
                                               Количество) Экспорт

	СтрокаШтрихкод   = СвязываемыеПоля.Найти(Перечисления.ТСДПоляДанных.ШтрихКод,
	                                         "ПараметрНоменклатуры");
	СтрокаКоличество = СвязываемыеПоля.Найти(Перечисления.ТСДПоляДанных.КоличествоНаСкладе,
	                                         "ПараметрНоменклатуры");
	СтрокаШтрихкод   = ?(СтрокаШтрихкод = Неопределено,
	                     "",
	                     "Поле" + Формат(СтрокаШтрихкод.ПолеТСД, "ЧГ=0"));
	СтрокаКоличество = ?(СтрокаКоличество = Неопределено,
	                     "",
	                     "Поле" + Формат(СтрокаКоличество.ПолеТСД, "ЧГ=0"));
	ВремШтрихкод     = СоответствиеПолей[СтрокаШтрихкод];
	ВремКоличество   = СоответствиеПолей[СтрокаКоличество];

	Штрихкод         = ?(ВремШтрихкод = Неопределено, "", ВремШтрихкод);
	Попытка
		Количество = Число(ВремКоличество);
	Исключение
		Количество = 0;
	КонецПопытки;

КонецПроцедуры // ПолучитьСодержимоеСоответствияПолейТСД()

///////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью"
//
// Параметры
//  Отказ - <Булево>
//        - признак отказа от записи элемента. Если в теле 
//          процедуры-обработчика установить данному параметру
//          значение Истина, запись элемента выполнена не будет
//
Процедура ПередЗаписью(Отказ)
	
	Перем Ошибки;
	Перем ШтрихКод;
	Перем ЕстьШтрихКод;
	Перем ЗаполненыПараметрыНоменклатуры;
	Перем ЗаполненыПоляТСД;
	Перем УникальныеПараметрыНоменклатуры;
	Перем УникальныеПоляТСД;
	Перем ПараметрыНоменклатуры;
	Перем ПоляТСД;
	Перем СтрокаТЧ;
	
	Если Не ОбменДанными.Загрузка Тогда
		
		Ошибки                          = "";
		ЕстьШтрихКод                    = Ложь;
		ЗаполненыПараметрыНоменклатуры  = Истина;
		ЗаполненыПоляТСД                = Истина;
		УникальныеПараметрыНоменклатуры = Истина;
		УникальныеПоляТСД               = Истина;
		ПараметрыНоменклатуры           = Новый Соответствие();
		ПоляТСД                         = Новый Соответствие();
		
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда
			Ошибки = НСтр("ru=' - Не задано имя формата.';uk="" - Не задано ім'я формату.""");
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из СвязываемыеПоля Цикл
			
			Если СтрокаТЧ.ПараметрНоменклатуры = Перечисления.ТСДПоляДанных.ШтрихКод Тогда
				ЕстьШтрихКод = Истина;
			КонецЕсли;
		
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ПараметрНоменклатуры) Тогда
				ЗаполненыПараметрыНоменклатуры = Ложь;
			ИначеЕсли ПараметрыНоменклатуры[СтрокаТЧ.ПараметрНоменклатуры] = Истина Тогда
				УникальныеПараметрыНоменклатуры = Ложь;
			Иначе
				ПараметрыНоменклатуры.Вставить(СтрокаТЧ.ПараметрНоменклатуры, Истина);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ПолеТСД) Тогда
				ЗаполненыПоляТСД = Ложь;
			ИначеЕсли ПоляТСД[СтрокаТЧ.ПолеТСД] = Истина Тогда
				УникальныеПоляТСД = Ложь;
			Иначе
				ПоляТСД.Вставить(СтрокаТЧ.ПолеТСД, Истина);
			КонецЕсли;
		
		КонецЦикла;
		
		Если Не ЕстьШтрихКод Тогда
			Если Не ПустаяСтрока(Ошибки) Тогда
				Ошибки = Ошибки + "
				|";
			КонецЕсли;
			Ошибки = Ошибки + НСтр("ru=' - Параметр номенклатуры ""Штрихкод"" должен выгружаться в обязательном порядке.';uk=' - Параметр номенклатури ""Штрихкод"" повинен вивантажуватися в обов''язковому порядку.'");
		КонецЕсли;
		
		Если Не ЗаполненыПараметрыНоменклатуры Тогда
			Если Не ПустаяСтрока(Ошибки) Тогда
				Ошибки = Ошибки + "
				|";
			КонецЕсли;
			Ошибки = Ошибки + НСтр("ru=' - Обнаружены незаполненные параметры номенклатуры.';uk=' - Виявлені незаповнені параметри номенклатури.'");
		КонецЕсли;
		
		Если Не ЗаполненыПоляТСД Тогда
			Если Не ПустаяСтрока(Ошибки) Тогда
				Ошибки = Ошибки + "
				|";
			КонецЕсли;
			Ошибки = Ошибки + НСтр("ru=' - Обнаружены незаполненные поля терминала.';uk=' - Виявлені незаповнені поля терміналу.'");
		КонецЕсли;
		
		Если Не УникальныеПараметрыНоменклатуры Тогда
			Если Не ПустаяСтрока(Ошибки) Тогда
				Ошибки = Ошибки + "
				|";
			КонецЕсли;
			Ошибки = Ошибки + НСтр("ru=' - Обнаружен параметр номенклатуры, выгружаемый в два поля одновременно.';uk=' - Виявлено параметр номенклатури, що вивантажується в два поля одночасно.'");
		КонецЕсли;
		
		Если Не УникальныеПоляТСД Тогда
			Если Не ПустаяСтрока(Ошибки) Тогда
				Ошибки = Ошибки + "
				|";
			КонецЕсли;
			Ошибки = Ошибки + НСтр("ru=' - Обнаружено поле терминала, в которое выгружаются несколько параметров одновременно.';uk=' - Виявлено поле терміналу, в яке вивантажуються декілька параметрів одночасно.'");
		КонецЕсли;
		
		Если Не ПустаяСтрока(Ошибки) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='При попытке записи были обнаружены следующие ошибки:"
"';uk='При спробі запису були виявлені наступні помилки:"
"'") + Ошибки);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

///////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мПолеШтрихкод                   = Перечисления.ТСДПоляДанных.ШтрихКод;
мПолеНаименованиеНоменклатуры   = Перечисления.ТСДПоляДанных.НоменклатураНаименование;
мПолеАртикулНоменклатуры        = Перечисления.ТСДПоляДанных.НоменклатураАртикул;
мПолеХарактеристикаНоменклатуры = Перечисления.ТСДПоляДанных.НоменклатураХарактеристика;
мПолеСерияНоменклатуры          = Перечисления.ТСДПоляДанных.НоменклатураСерия;
мПолеЕдиницаИзмерения           = Перечисления.ТСДПоляДанных.НоменклатураИзмерение;
мПолеКодНоменклатуры            = Перечисления.ТСДПоляДанных.НоменклатураКод;
мПолеЦенаНоменклатуры           = Перечисления.ТСДПоляДанных.НоменклатураЦена;
мПолеКоличествоНоменклатуры     = Перечисления.ТСДПоляДанных.КоличествоНаСкладе;
мПолеКачество                   = Перечисления.ТСДПоляДанных.Качество;
